# see https://github.com/Homebrew/homebrew-bundle for docs
#
# (TL;DR: $./runbrew.sh <brewfile>
# 
# )
#
# Do not install items from the following list that you have already installed (unless they were installed via brew).
# First either remove them from this list, or  (preferred for easy maintenance) remove them from your system.
#
# )

# Install Cask functionality
cask_args appdir: '/Applications'
tap 'caskroom/cask'

# Install Brews

brew 'ansible'
brew 'autoconf'
brew 'automake'
brew 'ffmpeg'
brew 'gettext'
brew 'git'
brew 'glib'
brew 'handbrake'
brew 'jpeg'
brew 'libffi'
brew 'libpng'
brew 'libtool'
brew 'openssl'
brew 'mas'
brew 'mkvtoolnix'
brew 'mongodb'
brew 'mp4v2'
brew 'node'
brew 'pcre'
brew 'pkg-config'
brew 'python'
brew 'redis'
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-gemset'
brew 'xz'


# Install Casks

cask '1password'        # password manager
cask 'arq'              # backup tool
cask 'backblaze'        # backup
cask 'bbedit'           # text editor
cask 'calibre'          # e-book organizer/converter
cask 'charles'          # proxy/debugging
cask 'cura'             # 3d-printer layering tool
cask 'dropbox'
cask 'fauxpas'          # xcode lint
cask 'google-drive'
cask 'grandperspective' # disk space visualizer
cask 'keybase'
cask 'omnigraffle'
cask 'printrun'         # 3d-printer communication tool
cask 'slack'
cask 'tower'            # git client GUI
cask 'transmit'         # sftp client
cask 'virtualbox'
cask 'vlc'

#TODO: android-sdk and versions
